mdhardenburgh/Blinky/Packages/.cache/Keil.LPC4300_DFP.2.9.0.pdsc
            // Disable Reset Vector Catch in DEMCR
            Write32(DEMCR_Addr, (Read32(DEMCR_Addr) &amp; (~0x00000001)));
          </block>
        </sequence>

        <!-- Override for Pre-Defined Trace Sequences -->
        <sequence name="TraceStart">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("EnableTraceBuffer");
            </block>
          </control>

        </sequence>

        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;
            __var traceBuffer = (__traceout &amp; 0x4) != 0;
          </block>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>

          <control if="traceBuffer">
            <block>
              Sequence("DisableTraceBuffer");
            </block>
          </control>

        </sequence>

        <!-- User-defined Sequences -->
        <sequence name="EnableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Setup fixed TRACECLK pin
            Write32(0x40086790, 0x000000B2); // LPC_SCU->SFSPF_4 : Func 2, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
          </block>

          <!-- TRACEDATA[0]-->
          <control if="(RoutingTPIU &amp; 0x1) == 0">
            <!-- TRACEDATA[0]: PF_5 -->
            <block>
              Write32(0x40086794, 0x000000B3); // LPC_SCU->SFSPF_5 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
            </block>
          </control>
          <control if="(RoutingTPIU &amp; 0x1)">
            <!-- TRACEDATA[0]: P7_4 -->
            <block>
              Write32(0x40086390, 0x000000B5); // LPC_SCU->SFSP7_4 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
            </block>
          </control>


          <control if="tracePortWidth &gt;= 2">
            <!-- TRACEDATA[1]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[1]: PF_6 -->
              <block>
                Write32(0x40086798, 0x000000B3); // LPC_SCU->SFSPF_6 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[1]: P7_5 -->
              <block>
                Write32(0x40086394, 0x000000B5); // LPC_SCU->SFSP7_5 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
          </control>

          <control if="tracePortWidth &gt;= 4">
            <!-- TRACEDATA[2]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[2]: PF_7 -->
              <block>
                Write32(0x4008679C, 0x000000B3); // LPC_SCU->SFSPF_7 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[2]: P7_6 -->
              <block>
                Write32(0x40086398, 0x000000B5); // LPC_SCU->SFSP7_6 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>

            <!-- TRACEDATA[3]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[3]: PF_8 -->
              <block>
                Write32(0x400867A0, 0x000000B3); // LPC_SCU->SFSPF_8 : Func 3, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[3]: P7_7 -->
              <block>
                Write32(0x4008639C, 0x000000B5); // LPC_SCU->SFSP7_7 : Func 5, EPD 0, EPUN 1, EHS 1, EZI 0, ZIF 1
              </block>
            </control>
          </control>
        </sequence>

        <sequence name="EnableTraceBuffer">
          <block>
            // ETB accesses SRAM at 0x2000C000 - 0x2000FFFF.
            //  This memory region is not available to application when using ETB.
            Write32(0x40043128, 0x00000000); // ETBCFG: ETB bit
          </block>
        </sequence>

        <sequence name="DisableTraceTPIU">
          <block>
            __var tracePortWidth = (__traceout &amp; 0x003F0000) &gt;&gt; 16;

            // Setup fixed TRACECLK pin
            Write32(0x40086790, 0x00000000); // LPC_SCU->SFSPF_4 : Reset Value 0x00000000
          </block>

          <!-- TRACEDATA[0]-->
          <control if="(RoutingTPIU &amp; 0x1) == 0">
            <!-- TRACEDATA[0]: PF_5 -->
            <block>
              Write32(0x40086794, 0x00000000); // LPC_SCU->SFSPF_5 : Reset Value 0x00000000
            </block>
          </control>
          <control if="(RoutingTPIU &amp; 0x1)">
            <!-- TRACEDATA[0]: P7_4 -->
            <block>
              Write32(0x40086390, 0x00000000); // LPC_SCU->SFSP7_4 : Reset Value 0x00000000
            </block>
          </control>


          <control if="tracePortWidth &gt;= 2">
            <!-- TRACEDATA[1]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[1]: PF_6 -->
              <block>
                Write32(0x40086798, 0x00000000); // LPC_SCU->SFSPF_6 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[1]: P7_5 -->
              <block>
                Write32(0x40086394, 0x00000000); // LPC_SCU->SFSP7_5 : Reset Value 0x00000000
              </block>
            </control>
          </control>

          <control if="tracePortWidth &gt;= 4">
            <!-- TRACEDATA[2]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[2]: PF_7 -->
              <block>
                Write32(0x4008679C, 0x00000000); // LPC_SCU->SFSPF_7 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[2]: P7_6 -->
              <block>
                Write32(0x40086398, 0x00000000); // LPC_SCU->SFSP7_6 : Reset Value 0x00000000
              </block>
            </control>

            <!-- TRACEDATA[3]-->
            <control if="(RoutingTPIU &amp; 0x1) == 0">
              <!-- TRACEDATA[3]: PF_8 -->
              <block>
                Write32(0x400867A0, 0x00000000); // LPC_SCU->SFSPF_8 : Reset Value 0x00000000
              </block>
            </control>
            <control if="(RoutingTPIU &amp; 0x1)">
              <!-- TRACEDATA[3]: P7_7 -->
              <block>
                Write32(0x4008639C, 0x00000000); // LPC_SCU->SFSP7_7 : Reset Value 0x00000000
              </block>
            </control>
          </control>

        </sequence>

        <sequence name="DisableTraceBuffer">
          <block>
            // AHB accesses SRAM at 0x2000C000 - 0x2000FFFF.
            Write32(0x40043128, 0x00000001); // ETBCFG: ETB bit
          </block>
        </sequence>
      </sequences>
      <!-- ***********************  End Debug Description **************************** -->

