mdhardenburgh/Blinky/Packages/.cache/Keil.LPC4300_DFP.2.9.0.pdsc
          <book name="Documents/LPC435X_3X_2X_1X.pdf" title="LPC435x/3x/2x/1x Data Sheet"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'LPC436x'  **************************** -->
      <subFamily DsubFamily="LPC436x">
        <processor Pname="Cortex-M4"                                          Dfpu="0"/>
        <processor Pname="Cortex-M0Sub" Dcore="Cortex-M0" DcoreVersion="r0p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="204000000"/>
        <compile   Pname="Cortex-M0Sub" define="CORE_M0SUB"/>

        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="USBD"          n="2"/>
        <feature type="LCD"           n="1"/>
        <feature type="SPI"           n="1"/>
        <feature type="MPSerial"      n="1"                           name="SSP"/>
        <feature type="PWM"           n="6"/>

        <!-- *************************  Debug Description  ***************************** -->
        <debug Pname="Cortex-M0Sub" __dp="2" __ap="0" svd="SVD/LPC43xx.svd"/>

        <debugport __dp="1">          <!-- Redefinition of Cortex-M0 DP, uses different TAP index for this sub-family -->
          <jtag tapindex="2"/>
        </debugport>
        <debugport __dp="2">          <!-- Cortex-M0Sub DP-->
          <jtag tapindex="1"/>
        </debugport>

        <debug defaultResetSequence="ResetProcessor" Pname="Cortex-M0Sub"/>

        <sequences>
          <!-- Begin: ResetProcessor Sequence for Cortex-M0Sub -->
          <sequence name="ResetProcessor" Pname="Cortex-M0Sub">
            <block>
                // Reset only Cortex-M0Sub Core
                Write32(0x40053100, 0x00001000);

                // Clear Exception States (safe, Core in reset)
                Write32(0xE000ED0C, 0x05FA0002);

                // Release from reset
                Write32(0x40053100, 0);
            </block>
          </sequence>
          <!-- End: ResetProcessor Sequence for Cortex-M0Sub -->

          <!-- Begin: Pre-defined ResetCatchSet Sequence -->
          <sequence name="ResetCatchSet" Pname="Cortex-M0Sub">
            <block>
              __var resetVecBankA = 0;
              __var resetVecBankB = 0;

              // Clear Reset Vector Catch
              Write32(0xE000EDFC, Read32(0xE000EDFC) &amp; (~0x00000001));

              // Read reset vector from bank A
              resetVecBankA = Read32(0x1A000004);
              // Read reset vector from bank B
              resetVecBankB = Read32(0x1B000004);
            </block>

            <control if="resetVecBankA &lt; 0x20000000">
              <!-- Reset Vector of bank A in HW Breakpoint range-->
              <control if="(resetVecBankA &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 0
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE0002008, (resetVecBankA &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 0
                </block>
              </control>
            </control>

            <control if="resetVecBankB &lt; 0x20000000">
              <!-- Reset Vector of bank B in HW Breakpoint range-->
              <control if="(resetVecBankB &amp; 0x2) == 0">
                <block>
                  // Even Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x40000001); // Write address to FPB Comparator 1
                </block>
              </control>
              <control if="resetVecBankA &amp; 0x2">
                <block>
                  // Odd Address
                  Write32(0xE000200C, (resetVecBankB &amp; 0x1FFFFFFC) | 0x80000001); // Write address to FPB Comparator 1
                </block>
              </control>
            </control>

            <block>
              // Enable FPB
              Write32(0xE0002000, 0x00000003);
            </block>

          </sequence>
          <!-- End: Pre-defined ResetCatchSet Sequence -->

          <!-- Begin: Pre-defined ResetCatchClear Sequence -->
          <sequence name="ResetCatchClear" Pname="Cortex-M0Sub">
            <block>
              // Clear FPB Comparators 0 and 1
              Write32(0xE0002008, 0x00000000);
              Write32(0xE000200C, 0x00000000);

              // Disable FPB
              Write32(0xE0002000, 0x00000002);
            </block>
          </sequence>
          <!-- End: Pre-defined ResetCatchClear Sequence -->

          <!-- Begin: DebugCoreStart Sequence for Cortex-M0Sub -->
          <sequence name="DebugCoreStart" Pname="Cortex-M0Sub">
            <block>
              // Default implementation

              // Enable Core Debug via DHCSR
              Write32(0xE000EDF0, 0xA05F0001);
            </block>

            <control if="ReleaseM0SubOnConnect">
              <block>
                // Release M0 from reset
                Write32(0x40053100, 0x00000000);  // RESET_CTRL0: Clear M0_SUB_RST (Bit 12)
              </block>
            </control>
          </sequence>
          <!-- End: DebugCoreStart Sequence for Cortex-M0Sub  -->
        </sequences>
        <!-- **********************  End Debug Description  *************************** -->

        <!-- *************************  Device 'LPC4367'  ***************************** -->
        <device Dname="LPC4367">
          <memory id="IROM1"                             start="0x1A000000" size="0x80000"    startup="1"   default="1"/>
          <memory id="IROM2"                             start="0x1B000000" size="0x80000"    startup="0"   default="1"/>
          <memory id="IRAM1"                             start="0x10000000" size="0x08000"    init   ="0"   default="1"/>
          <memory id="IRAM2"                             start="0x20000000" size="0x10000"    init   ="0"   default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BA.FLM" start="0x1A000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <algorithm name="Flash/LPC18xx43xx_512_BB.FLM" start="0x1B000000" size="0x80000" RAMstart="0x10000000" RAMsize="0x0FE0" default="1"/>
          <environment name="uv">
            <postBuild1>$K/ARM/BIN/ElfDwT.exe !L BASEADDRESS(0x1A000000)</postBuild1>
            <postRun1> 1 </postRun1>
          </environment>
          <book name="Documents/LPC436X.pdf" title="LPC436x Data Sheet"/>
        </device>
      </subFamily>

