mdhardenburgh/Blinky/Packages/.cache/Keil.LPC4300_DFP.2.9.0.pdsc
      <component Cgroup="Audio" Capiversion="1.0.1" condition="LPC4300 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/Keil/MCB4300/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>

    <!-- LPC4330-Xplorer Development Board -->
    <bundle Cbundle="LPC4330-Xplorer" Cclass="Board Support" Cversion="1.0.0">
      <description>NGX LPC4330-Xplorer Board Support</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>LED interface for NGX LPC4330-Xplorer Development Board</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/LED_LPC4330-Xplorer.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="LPC4300 CMSIS SCU GPIO">
        <description>Buttons interface for NGX LPC4330-Xplorer Development Board</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/Buttons_LPC4330-Xplorer.c"/>
        </files>
      </component>
      <component Cgroup="Audio" Capiversion="1.0.1" condition="LPC4300 CMSIS SCU GPIO SAI/I2C Driver">
        <description>Audio interface for UDA1380</description>
        <files>
          <file category="source" name="Boards/NGX/LPC4330-Xplorer/Common/Audio_UDA1380.c"/>
        </files>
      </component>
    </bundle>
  </components>
</package>
